'use strict';

const difference = () => {
  for (let i = 0; i <= 2; i++) {
    var first = 1;
    const second = 2;
    const third = 3;
    console.log(third);
  }
  console.log(first, second);
  console.log(third);
};
console.log(difference());

/*
Змінна, оголошена через var виводиться в консоль, бо var ігнорує блочну область видимості.

Змінна, оголошена через let викликає помилку при спробі вивести її в консоль, тому що ми не можемо взяти
значення локальної змінної (з блочної області вилимості) і отримати її в будь-якій іншій області видимості.

Константа, викликана всередині тіла циклу, виводиться ту кількість разів, яку спрацьовує тіло циклу.
Та сама константа, яка викликана поза блочною областю видимості (поза тілом циклу), виводить помилку при
спробі вивести її в консоль з іншої області видимості, адже let і const не ігнорують блочну область вилимості.
 */
