'use strict';

// 1
console.log('Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).');
for (let i = 0; i <= 30; i += 0.5) {
  if (i >= 20 && i <= 30) {
    console.log(i);
  }
}
// 2
console.log('Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.');
for (let i = 10; i <= 100; i += 10) {
  console.log(`27 * ${i} = ${27 * i}`);
}
// 3
console.log('Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.');
const num = +prompt('введіть ціле число');
for (let i = 1; i <= 100; i++) {
  if (i ** 2 <= num) {
    console.log(i ** 2);
  }
}
// 4
console.log('Дане ціле число. З\'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).');
for (let i = 1; i <= 100; i++) {
  if (i % 2 === 0) {
    console.log(` ${i} is not simple`);
  } else {
    console.log(`${i} is simple`);
  }
}
// 5
console.log('Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).');
for (let i = 0; i <= num; i++) {
  if (3 ** i === num) {
    console.log('yes');
  } else {
    console.log('no');
  }
}
